Hello @kalamity-linden, yes of course! If I understood your question correctly the following should work for you:

main.tf:
```
provider "aws" {
  region = "us-east-1"

  access_key = "test"
  secret_key = "test"

  s3_force_path_style         = true
  skip_credentials_validation = true
  skip_metadata_api_check     = true
  skip_requesting_account_id  = true

  endpoints {
    apigateway = "http://localhost:4566"
    kinesis    = "http://localhost:4566"
    lambda     = "http://localhost:4566"
    s3         = "http://localhost:4566"
  }
}


resource "aws_api_gateway_rest_api" "MyDemoAPI" {
  name        = "MyDemoAPI"
  description = "This is my API for demonstration purposes"
}

resource "aws_api_gateway_resource" "MyDemoResource" {
  rest_api_id = aws_api_gateway_rest_api.MyDemoAPI.id
  parent_id   = aws_api_gateway_rest_api.MyDemoAPI.root_resource_id
  path_part   = "{proxy+}"
}

output "aws_api_gw_id" {
  value = aws_api_gateway_rest_api.MyDemoAPI.id
}
```

Command:
```
$ terraform  apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_resource.MyDemoResource will be created
  + resource "aws_api_gateway_resource" "MyDemoResource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{proxy+}"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.MyDemoAPI will be created
  + resource "aws_api_gateway_rest_api" "MyDemoAPI" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "This is my API for demonstration purposes"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "MyDemoAPI"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = (known after apply)
          + vpc_endpoint_ids = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_api_gw_id = (known after apply)
aws_api_gateway_rest_api.MyDemoAPI: Creating...
aws_api_gateway_rest_api.MyDemoAPI: Creation complete after 0s [id=ltiis80xeg]
aws_api_gateway_resource.MyDemoResource: Creating...
aws_api_gateway_resource.MyDemoResource: Creation complete after 0s [id=i7qthe467y]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

Outputs:

aws_api_gw_id = "ltiis80xeg"
```

Verifying via AWS CLI:
```
$ awslocal apigateway get-rest-apis
{
    "items": [
        {
            "id": "ltiis80xeg",
            "name": "MyDemoAPI",
            "description": "This is my API for demonstration purposes",
            "createdDate": 1623100301,
            "version": "V1",
            "binaryMediaTypes": [],
            "apiKeySource": "HEADER",
            "endpointConfiguration": {
                "types": [
                    "EDGE"
                ]
            },
            "tags": {},
            "disableExecuteApiEndpoint": false
        }
    ]
}
```